blog/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Sunday, December  4, 2022 at  5:26 PM -->
<meta charset="utf-8" />
<title>Kinhung Lam ∴ A Weblog</title>
<meta name="author" content="kinhung lam" />
<meta name="generator" content="Org Mode" />
<meta name="twitter:site" content="@twylo" />
<meta name="twitter:creator" content="@twylo" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="me" href="https://weibo.com/u/2150445074" />
<link rel="icon" type="image/png" href="/images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="/images/icon/apple-touch-icon.png" />
<link rel="alternate" type="application/rss+xml" title="Weblog RSS Feed" href="/blog/rss.xml" />
<link rel="stylesheet" type="text/css" href="/res/faces.css">
<link rel="stylesheet" type="text/css" href="/res/style.css">
</head>
<body>
<div id="preamble" class="status">
<a class="skip-nav-link" href="#content">
  Skip navigation
</a>
<nav>
  <div class="navitem"><a href="/">Home</a></div>
  <div class="navitem"><a href="/blog/">Weblog</a></div>
  <div class="navitem"><a href="/portfolio/">Portfolio</a></div>
  <div class="navitem"><a href="/resume.html">Resume</a></div>
  <div class="navitem"><a href="/contact.html">Contact</a></div>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Kinhung Lam ∴ A Weblog</h1>
</header>
<div id="outline-container-orge94a934" class="outline-2">
<h2 id="orge94a934"><a href="2022-12-03 My reading history in 2022.html">2022年阅读历史</a></h2>
<div class="outline-text-2" id="text-orge94a934">
<div class="published" id="orge4fcd1e">
<p>
Saturday, December  3, 2022 at  9:20 PM CST
</p>

</div>
<p>
晚上看了 吴鲁加老师的 <a href="https://mp.weixin.qq.com/s/L6jw60lqdLqMCeDwKMfP8g">2021好书推荐</a> ，就想着也可以记录下，于是就有了这篇文章哈。
</p>

<p>
2022年快过去了，想来今年也看了几本书，可以在这做个小结吧。近几年都比较少写年末总结，说来惭愧，每年年初的目标基本上没有完成。
</p>

<p>
近来我看的书，基本上包括了编程、投资、社科、教育等，我看得比较慢，所以每年基本上都只有几本。
</p>
</div>

<div id="outline-container-org0642b29" class="outline-3">
<h3 id="org0642b29">工作相关：</h3>
<div class="outline-text-3" id="text-org0642b29">
<p>
《深入实践Spring Boot》
</p>

<p>
《Java 并发编程实践》，重读
</p>

<p>
《Java 并发编程艺术》，重读
</p>

<p>
《Python 核心编程》
</p>

<p>
《Activiti 实战》
</p>

<p>
《数据中台架构-企业》
</p>

<p>
《Learn GNU Emacs》
</p>

<p>
《计算机程序的构造与解释》
</p>

<p>
《黑客与画家》
</p>

<p>
《Build web application with Golang》
</p>

<p>
《Programming Clojure》
</p>

<p>
《Clojure Programming》
</p>

<p>
《白话区块链》
</p>

<p>
《深入理解 Java 虚拟机》，重读新版
</p>

<p>
《算法》
</p>

<p>
《代码未来》
</p>

<p>
《Rust 权限指南》
</p>
</div>
</div>

<div id="outline-container-org74be59c" class="outline-3">
<h3 id="org74be59c">投资：</h3>
<div class="outline-text-3" id="text-org74be59c">
<p>
《投资最重要的事》
</p>

<p>
《文明、现代化、价值投资与中国》，第三遍重读
</p>

<p>
《股票大作手回忆录》
</p>

<p>
《黑天鹅》
</p>

<p>
《随机漫步的傻瓜》
</p>

<p>
《异类：不一样的成功启示录》
</p>

<p>
《指数基金投资指南》
</p>
</div>
</div>

<div id="outline-container-orgab9cbe5" class="outline-3">
<h3 id="orgab9cbe5">社科文学：</h3>
<div class="outline-text-3" id="text-orgab9cbe5">
<p>
《枪炮、病菌与钢铁》
</p>

<p>
《置身事内：中国政府与经济发展》
</p>

<p>
《底层逻辑》
</p>
</div>
</div>

<div id="outline-container-org792479e" class="outline-3">
<h3 id="org792479e">经济：</h3>
<div class="outline-text-3" id="text-org792479e">
<p>
《宏观经济通识课》
</p>

<div class="morelink" id="org93102c4">
<p>
<a href="2022-12-03 My reading history in 2022.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
</div>
<div id="outline-container-orgc9c71b8" class="outline-2">
<h2 id="orgc9c71b8"><a href="2017-02-04-2016-personal-summary.html">Looking back on 2016 and looking forward to 2017</a></h2>
<div class="outline-text-2" id="text-orgc9c71b8">
<div class="published" id="orgfba45e9">
<p>
Saturday, February  4, 2017 at 11:02 AM CST
</p>

</div>
<p>
转眼一年又过去了！大家都很早写好总结和展望了，可是我迟迟未动手，只因为我比较懒。。
</p>

<p>
回顾 2016，哈哈！
</p>
</div>

<div id="outline-container-当然也实现了一些小目标" class="outline-4">
<h4 id="当然也实现了一些小目标">当然也实现了一些小目标：</h4>
<div class="outline-text-4" id="text-当然也实现了一些小目标">
<p>
跑了一个半程马拉松，虽然是第一次，但还是成功完赛，并取得了一枚小奖牌；
负责的教育资讯类产品成功上线，虽然目前用户量还不具规模，但也算是小有成就了，希望可以继续变得越来越好！
</p>

<div class="morelink" id="orgd3dfa09">
<p>
<a href="2017-02-04-2016-personal-summary.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
</div>
<div id="outline-container-org10c273d" class="outline-2">
<h2 id="org10c273d"><a href="2015-12-19-centos-mongo-install.html">Mongo installed and confiure</a></h2>
<div class="outline-text-2" id="text-org10c273d">
<div class="published" id="org6a83e53">
<p>
Saturday, December 19, 2015 at  9:54 PM CST
</p>

</div>
<p>
<b>1. 创建 /etc/yum.repos.d/mongodb-org-3.0.repo</b>
</p>

<pre class="example" id="org5bbb633">
[mongodb-org-3.0]
name=MongoDB Repository
baseurl=https://repo.mongodb.org/yum/redhat/$releasever/mongodb-org/3.0/x86_64/
gpgcheck=0
enabled=1
</pre>

<p>
<b>2. yum安装mongo</b>
</p>

<pre class="example">
=sudo yum install -y mongodb-org=
</pre>

<p>
或者 指定版本
</p>

<pre class="example">
=sudo yum install -y mongodb-org-3.0.7 mongodb-org-server-3.0.7 mongodb-org-shell-3.0.7 mongodb-org-mongos-3.0.7 mongodb-org-tools-3.0.7=
</pre>

<p>
为了阻止以后更新，你可能需要修改/etc/yum.conf文件，添加配置：
</p>

<pre class="example">
=exclude=mongodb-org,mongodb-org-server,mongodb-org-shell,mongodb-org-mongos,mongodb-org-tools=
</pre>

<div class="morelink" id="org74bf14d">
<p>
<a href="2015-12-19-centos-mongo-install.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-org9cbe442" class="outline-2">
<h2 id="org9cbe442"><a href="2015-12-19-centos-elasticsearch-install.html">Elasticsearch installed tips</a></h2>
<div class="outline-text-2" id="text-org9cbe442">
<div class="published" id="orgeb5ac54">
<p>
Saturday, December 19, 2015 at  9:53 PM CST
</p>

</div>
<p>
<i>1. 下载安装包</i>
</p>

<p>
<i>2. 修改config配置文件</i>
</p>

<p>
<i>3. 运行 ./bin/elasticsearch</i>
</p>

<p>
<i>4. 验证：curl 'http://localhost:9200</i>?pretty'/
</p>

<p>
<b>5. 关闭：curl -XPOST 'http://localhost:9200/_shutdown'</b>
</p>

<p>
<i>6. 安装head plugin</i>
</p>

<p>
Running as a plugin of ElasticSearch (this is the preferred method)
</p>

<p>
<code>elasticsearch/bin/plugin -install mobz/elasticsearch-head</code>
</p>

<p>
<a href="http://localhost:9200/_plugin/head/=%E6%9F%A5%E7%9C%8B%E6%98%AF%E5%90%A6%E6%88%90%E5%8A%9F%E5%AE%89%E8%A3%85">http://localhost:9200/_plugin/head/=查看是否成功安装</a>
</p>
<hr>
</div>
</div>
<div id="outline-container-org95393ea" class="outline-2">
<h2 id="org95393ea"><a href="2015-12-19-centos-vsftpd-install.html">vsftpd installed and configure</a></h2>
<div class="outline-text-2" id="text-org95393ea">
<div class="published" id="org26bfa28">
<p>
Saturday, December 19, 2015 at  9:53 PM CST
</p>

</div>
<p>
<b>1. yum install vsftpd</b>
</p>

<p>
<b>2. 配置/etc/vsftpd/vsftpd.conf</b>
</p>

<p>
配置参考如下：
</p>

<pre class="example" id="orga6cfd98">
anonymous_enable=NO
local_enable=YES
write_enable=YES
local_umask=022
dirmessage_enable=YES
xferlog_enable=YES
connect_from_port_20=YES
ascii_upload_enable=YES
ascii_download_enable=YES
chroot_local_user=YES
chroot_list_enable=YES
chroot_list_file=/etc/vsftpd/chroot_list
listen=YES
pam_service_name=vsftpd
userlist_enable=YES
tcp_wrappers=YES
use_localtime=YES
allow_writeable_chroot=YES
</pre>

<div class="morelink" id="orgd5ae253">
<p>
<a href="2015-12-19-centos-vsftpd-install.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-org8648b1c" class="outline-2">
<h2 id="org8648b1c"><a href="2015-12-19-centos-mysql-install.html">Mysql installed and configure</a></h2>
<div class="outline-text-2" id="text-org8648b1c">
<div class="published" id="org63d4105">
<p>
Saturday, December 19, 2015 at  9:52 PM CST
</p>

</div>
<p>
原来是rpm安装，检查并卸载
</p>

<pre class="example" id="org8298836">
rpm -qa|grep -i mysql
rpm -ev MySQL-service-5.6.25-1.el7.x86_64
rpm -ev MySQL-client-5.6.25-1.el7.x86_64
</pre>

<p>
原来是yum安装，检查并卸载 <code>rpm -qa|grep mysql</code>
</p>

<p>
一般输出内容如下：
</p>

<pre class="example" id="org9d88bcf">
mysql-community-release-el7-5.noarch
mysql-community-client-5.7.7-0.3.rc.el7.x86_64
mysql-community-libs-5.7.7-0.3.rc.el7.x86_64
mysql-community-server-5.7.7-0.3.rc.el7.x86_64
mysql-community-common-5.7.7-0.3.rc.el7.x86_64
mysql-community-libs-compat-5.7.7-0.3.rc.el7.x86_64
</pre>

<div class="morelink" id="org853e3fd">
<p>
<a href="2015-12-19-centos-mysql-install.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-org292c92a" class="outline-2">
<h2 id="org292c92a"><a href="2014-08-07-merge-the-project-forked-from-github.html">Merge the project forked from github</a></h2>
<div class="outline-text-2" id="text-org292c92a">
<div class="published" id="org2c1c7fe">
<p>
Thursday, August  7, 2014 at  5:24 PM CST
</p>

</div>
<p>
Github真是一个好地方，相信很多程序员们都知道！大家在上面可能都有多多少少的个人项目。我们常常会关注自己兴趣以及xx大牛的项目，甚至于fork牛人们的项目，慢慢研究。但是牛人们的步伐，岂是偶等可以追逐的，他们可能一天=commit=很多次，这样就会导致我们刚刚=fork=的代码已经不是最新的了，那现在我们就来看下如何更新到原作者的最新代码。
</p>

<div class="morelink" id="orga655599">
<p>
<a href="2014-08-07-merge-the-project-forked-from-github.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-org1e0aba3" class="outline-2">
<h2 id="org1e0aba3"><a href="2014-07-23-a-note-of-programming-clojure.html">Clojure Programming</a></h2>
<div class="outline-text-2" id="text-org1e0aba3">
<div class="published" id="orgf13904a">
<p>
Wednesday, July 23, 2014 at 11:02 AM CST
</p>

</div>
<p>
1.use 用来导入clojure.core命名空间
</p>

<pre class="example" id="orgfc16a42">
user&gt;(clojure.core/use 'clojure.core)
</pre>

<p>
2.import导入java类
</p>

<pre class="example" id="orge88b28b">
user&gt;(import '(java.io InputStream File))
java.io.File
</pre>

<p>
3.require引入clj到当前命名空间
</p>

<pre class="example" id="orge9c36ad">
user&gt;(require 'clojure.string)
nil
</pre>

<div class="morelink" id="org2c56cd7">
<p>
<a href="2014-07-23-a-note-of-programming-clojure.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-orga118850" class="outline-2">
<h2 id="orga118850"><a href="2014-07-18-a-store.html">Setting up this blog</a></h2>
<div class="outline-text-2" id="text-orga118850">
<div class="published" id="org9eb2b00">
<p>
Friday, July 18, 2014 at  4:09 PM CST
</p>

</div>
<p>
<b><i>&#x2013;来源于互联网的小故事，虽然可能是某些人丰富想象力的创作，但我觉得挺有意思的，在这里做个记录</i></b>
</p>

<p>
*=25岁毕业=*，拿一万块钱月薪
</p>

<p>
*=30岁=*，涨到一万五，期间无女盆友，吃10块钱盖饭，跟同学合租，挤2块钱地铁上下班，存钱25万
</p>

<p>
*=31岁=*，啃老找父母要了35万块钱，买了50平米老房子一处，贷款90万，20年，月供6500。
</p>

<p>
*=35岁0个月=*，认识一4分木耳，接盘玩腻的木耳结婚。
</p>

<p>
*=35岁6个月=*，生了小孩，小孩眉宇间有高富帅的痕迹
</p>

<p>
*=36岁=*，工资涨到2万，木耳要买驴牌，便宜儿子要喝进口奶粉，压力很大
</p>

<p>
*=37岁=*，木耳说，人家的儿子都读花家地，读史家胡同，你也要给咱高富帅的儿子搞个学区房，你这个死没用的东西
</p>

<div class="morelink" id="org2396392">
<p>
<a href="2014-07-18-a-store.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-org02e8db2" class="outline-2">
<h2 id="org02e8db2"><a href="2014-07-17-this-is-life.html">This is life</a></h2>
<div class="outline-text-2" id="text-org02e8db2">
<div class="published" id="org0d36693">
<p>
Thursday, July 17, 2014 at  9:52 AM CST
</p>

</div>
<p>
上周经历了一次沉重的心路历程，也许是我内心不够强大，也许是每个人遇到相同的问题都会如此反应。不过总的来说是有惊无险，心也就慢慢释然了。同事们都感觉到我的变化，从一个性格相对开朗到如突然间默不做声，大家都表现出对我的关心，但我却无法告诉他们自己的想法！虽然内心比较痛苦，但却充满着温暖，慢慢在安慰着自己。
</p>

<p>
好了，上面的事情就此告一段落了。这阶段，外甥女的入学也搞定了，参加技术培训也完成了，经理人培训也结束了，工作在稳步进行中。总体来看，算是过到了一个平稳期。在工作上，我还想有更好的突破，昨天领导找我了，说今年加薪恐怕不太理想，公司在控制成本。。感觉整个部门都充满着困难和危机。今天离职的兄弟都走了7个了，却只进来两个没多少经验的新人。哎，替部门，替公司担忧！
</p>

<p>
我只能做的是，对自己的生活，工作负责，做*=最好的自己=*！
</p>

<div class="morelink" id="orgca034a6">
<p>
<a href="2014-07-17-this-is-life.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-orgdda77db" class="outline-2">
<h2 id="orgdda77db"><a href="2014-05-27-ji-yu-axis,-xfire,-cxfde-webserviceke-hu-duan.html">A Client of Webservice by Axis/XFire/CXF</a></h2>
<div class="outline-text-2" id="text-orgdda77db">
<div class="published" id="orgd2580dc">
<p>
Tuesday, May 27, 2014 at  2:59 PM CST
</p>

</div>
<p>
##Axis客户端调用 webservice
</p>

<pre class="example" id="orga9110a7">
URL endpointURL = new URL("http://localhost:8080/webservice/HelloService");  
            String requestText = "javalinjx"  
            Service service = new Service();  
            Call call = (Call) service.createCall();  
            call.setTargetEndpointAddress(endpointURL);  
            call.setOperationName("sayHello");  
            call.addParameter("xml", XMLType.XSD_STRING, ParameterMode.IN);  
            call.setReturnClass(String.class);  
            call.setReturnType(XMLType.XSD_STRING);// 设置返回类型  
            Object [] obj = new Object[]{ requestText };  
            String result = (String) call.invoke(obj);
</pre>

<div class="morelink" id="org020b563">
<p>
<a href="2014-05-27-ji-yu-axis,-xfire,-cxfde-webserviceke-hu-duan.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-org8f050ec" class="outline-2">
<h2 id="org8f050ec"><a href="2014-05-25-grep-and-find.html">Grep and Find</a></h2>
<div class="outline-text-2" id="text-org8f050ec">
<div class="published" id="org976c4b2">
<p>
Sunday, May 25, 2014 at  5:54 PM CST
</p>

</div>
<p>
##grep ###1.从文件中查找关键词 <b>grep 'linux' text.txt //查找包含
linux的关键词</b>
</p>

<pre class="example" id="org05fd28a">
[root@localhost ~]# grep 'root' /etc/group
root:x:0:root
bin:x:1:root,bin,daemon
</pre>

<p>
###2.从多个文件中查找关键词
</p>

<pre class="example" id="orgb938d04">
[root@localhost ~]# grep 'root' /etc/group /etc/my.cnf
/etc/group:root:x:0:root
/etc/my.cnf:user = root
</pre>

<p>
###3.查找当前目录下以及下辖子目录下所有包含str字符串的文件,会列出文件名.以及该行的内容.以及行号
</p>

<p>
<b>-n是打印行号，-r是在子目录也要查询</b>
</p>

<pre class="example" id="org7f8857b">
grep -n "str" -r ./
</pre>

<p>
<b>用 -i 搜索的时候可以忽略大小写</b>
</p>

<p>
<b>利用 -r 来完成所有的子目录下面执行相应的查找</b>
</p>

<p>
<b>用-l是打印所有的结果</b>
</p>

<div class="morelink" id="org7003e3d">
<p>
<a href="2014-05-25-grep-and-find.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-orgaf69d78" class="outline-2">
<h2 id="orgaf69d78"><a href="2014-05-10-countdownlatch.html">CountDownLatch</a></h2>
<div class="outline-text-2" id="text-orgaf69d78">
<div class="published" id="org4d9652a">
<p>
Saturday, May 10, 2014 at  3:29 PM CST
</p>

</div>
<p>
###同步工具类之闭锁-CountDownLatch
</p>

<p>
/闭锁/是一种同步工具类，可以延迟线程的进度直到其到达终止状态。闭锁的作用相当于一扇门：在闭锁到达结束状态之前，这扇门一直是关闭的，并且没有
任何线程能通过，当到达结束状态时，这扇门会打开并允许所有的线程通过。当闭锁到达结束状态后，将不会再改变状态，因此这扇门将永远保持打开状态。
闭锁可以用来确保某些活动直到其他活动都完成后才继续执行。
</p>

<p>
*=CountDownLatch=*是一种灵活的闭锁实现，可以在上述各种情况中使用，它可以使一个或多个线程等待一组事件发生。闭锁状态包括一个计数器，该计数器
被初始化为一个正数，表示需要等待的事件数量。=countDown=方法递减计数器，表示有一个事件已经发生了，而await方法等待计数器达到零，这表示所有
需要等待的事件都已经发生。如果计数器的值非零，那么=await=会一直阻塞直到计数器为零，或者等待中的线程中断，或者等待超时。
</p>

<pre class="example" id="orgab6f93b">
public class TestHarness {  
    public long timeTasks(int nthreads, final Runnable task) throws InterruptedException {  
        final CountDownLatch startGate = new CountDownLatch(1);  
        final CountDownLatch endGate = new CountDownLatch(nthreads);  

        for (int i = 0; i &lt; nthreads; i++) {  
        Thread t = new Thread(){  
            @Override  
            public void run() {  
                try{  
                    startGate.await();  
                    try{  
                        task.run();  
                    }finally {  
                        endGate.countDown();  
                    }  
                } catch (InterruptedException ignored) {}  
            }  
        };  
        t.start();  
        }  

        long start = System.nanoTime();  
        startGate.countDown();  
        endGate.await();  
        long end = System.nanoTime();  
        return end-start;  
    }  
}  
</pre>

<div class="morelink" id="org4382f0e">
<p>
<a href="2014-05-10-countdownlatch.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-orgc4f44ee" class="outline-2">
<h2 id="orgc4f44ee"><a href="2014-04-11-a-note-of-understanding-the-jvm.html">A note of Understanding the JVM</a></h2>
<div class="outline-text-2" id="text-orgc4f44ee">
<div class="published" id="org1c30ae0">
<p>
Friday, April 11, 2014 at  1:05 PM CST
</p>

</div>
<hr>

<p>
##java内存区域和内存溢出异常 ###运行时数据区域 * 程序计数器（Program
Counter Register） * Java虚拟机栈（Java Virtual Machine Stacks） *
本地方法栈（Native Method Stacks） * Java堆（Java Heap） *
方法区（Method Area） * 运行时常量池（Runtime Constant Pool） *
另：直接内存
</p>

<hr>

<p>
###程序计数器
</p>

<p>
程序计数器是一块较小的内存空间，它的作用可以看做是当前线程所执行的字节码的行号指示器。字节码解释器工作时就是通过改变这个计数器的值来选取下一条需要执行的字节码指令，分支、循环、跳转、异常处理、线程恢复等都需要它来完成。java虚拟机的多线程切换后需要恢复到正确的执行位置都需要一个独立的程序计数器，各线程之间的计数器互不影响，独立存储，所以这类内存区域为“线程私有”的内存。
如果线程正在执行的是一个java方法，这个计数器记录的是正在执行的虚拟机字节码指令的地址；如果正在执行的是Native方法，这个计数器值则为空（Undefined）。此内存区域是唯一一个在java虚拟机规范中没有规定任何OutOfMemoryError情况的区域。
</p>

<div class="morelink" id="orgffc1572">
<p>
<a href="2014-04-11-a-note-of-understanding-the-jvm.html">Read More →</a>
</p>

</div>

<hr>
</div>
</div>
<div id="outline-container-org787bcfa" class="outline-2">
<h2 id="org787bcfa"><a href="2014-04-09-my-first-octopress-blog.html">Setting up this blog</a></h2>
<div class="outline-text-2" id="text-org787bcfa">
<div class="published" id="org1bd4b40">
<p>
Monday, March 24, 2014 at  6:19 PM CST
</p>

</div>
</div>
<div id="outline-container-org715166e" class="outline-4">
<h4 id="org715166e">&#x2013;Setting up this blog</h4>
<div class="outline-text-4" id="text-org715166e">
<p>
:CUSTOM_ID: setting-up-this-blog
</p>
<p>
Apparently I'm using emacs org mode to power this
blog.Many thanks for the nice framework that save me a lot of time to
get up to speed.I probably wouldn't have decided to move my blog here in
the first place if there weren't ready-to-use solutions for lazy people
like me.
</p>

<p>
Anyway, here's the link to my old blog: <a href="http://javalinjx.iteye.com/">http://javalinjx.iteye.com/</a>
</p>
<hr>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer">
Proudly <a href="https://kinhung.me/blog/0110_emacs_blogging_for_fun_and_profit.html">published</a> with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>. This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">CC BY-SA 4.0</a> License. <a href="https://kinhung.me/privacy.html">Privacy Policy</a></div>
</div>
</body>
</html>
